CD2DBitmap.m_bAutoDestroyHBMP
TRUE if m_hBmpSrc should be destroyed; otherwise FALSE.

CD2DBitmap.m_hBmpSrc
Source bitmap handle.

CD2DBitmap.m_sizeDest
Bitmap destination size.

CD2DBitmap.m_strPath
Bitmap file path.

CD2DBitmap.m_lpszType
Resource type.

CD2DBitmap.m_uiResID
Bitmap resource ID.

CD2DBitmap.m_pBitmap
Stores a pointer to an ID2D1Bitmap object.

CD2DBitmap.Destroy
Destroys a CD2DBitmap object.

CD2DBitmap.Create(CRenderTarget*)
Creates a CD2DBitmap.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DBitmap.CommonInit
Initializes the object

CD2DBitmap.op_Implicit~ID2D1Bitmap*
Returns ID2D1Bitmap interface
Returns:
Pointer to an ID2D1Bitmap interface or NULL if object is not initialized yet.

CD2DBitmap.Get
Returns ID2D1Bitmap interface
Returns:
Pointer to an ID2D1Bitmap interface or NULL if object is not initialized yet.

CD2DBitmap.IsValid
Checks resource validity
Returns:
TRUE if resource is valid; otherwise FALSE.

CD2DBitmap.CopyFromMemory(System.Void!System.Runtime.CompilerServices.IsConst*,System.UInt32,CD2DRectU!System.Runtime.CompilerServices.IsConst*)
Copies the specified region from memory into the current bitmap
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
srcData: The data to copy
pitch: The stride, or pitch, of the source bitmap stored in srcData. The stride is the byte count of a scanline (one row of pixels in memory). The stride can be computed from the following formula: pixel width * bytes per pixel + memory padding
destRect: In the current bitmap, the upper-left corner of the area to which the region specified by srcRect is copied

CD2DBitmap.CopyFromRenderTarget(CRenderTarget!System.Runtime.CompilerServices.IsConst*,CD2DPointU!System.Runtime.CompilerServices.IsConst*,CD2DRectU!System.Runtime.CompilerServices.IsConst*)
Copies the specified region from the specified render target into the current bitmap
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: The render target that contains the region to copy
destPoint: In the current bitmap, the upper-left corner of the area to which the region specified by srcRect is copied
srcRect: The area of renderTarget to copy

CD2DBitmap.CopyFromBitmap(CD2DBitmap!System.Runtime.CompilerServices.IsConst*,CD2DPointU!System.Runtime.CompilerServices.IsConst*,CD2DRectU!System.Runtime.CompilerServices.IsConst*)
Copies the specified region from the specified bitmap into the current bitmap
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pBitmap: The bitmap to copy from
destPoint: In the current bitmap, the upper-left corner of the area to which the region specified by srcRect is copied
srcRect: The area of bitmap to copy

CD2DBitmap.GetDPI
Return the dots per inch (DPI) of the bitmap
Returns:
The horizontal and vertical DPI of the bitmap.

CD2DBitmap.GetPixelFormat
Retrieves the pixel format and alpha mode of the bitmap
Returns:
The pixel format and alpha mode of the bitmap.

CD2DBitmap.GetPixelSize
Returns the size, in device-dependent units (pixels), of the bitmap
Returns:
The size, in pixels, of the bitmap..

CD2DBitmap.GetSize
Returns the size, in device-independent pixels (DIPs), of the bitmap
Returns:
The size, in DIPs, of the bitmap.

CD2DBitmap.Detach
Detaches resource interface from the object
Returns:
Pointer to detached resource interface.

CD2DBitmap.Attach(ID2D1Bitmap*)
Attaches existing resource interface to the object
pResource: Existing resource interface. Cannot be NULL

CD2DBitmap.Dispose
The destructor. Called when a D2D bitmap object is being destroyed.

CD2DBitmap.#ctor(CRenderTarget*,System.Int32)
Constructs a CD2DBitmap object.
pParentTarget: A pointer to the render target.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DBitmap.#ctor(CRenderTarget*,HBITMAP__*,CD2DSizeU,System.Int32)
Constructs a CD2DBitmap object from HBITMAP.
pParentTarget: A pointer to the render target.
hbmpSrc: Handle to the bitmap.
sizeDest: Destination size of the bitmap.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DBitmap.#ctor(CRenderTarget*,System.Char!System.Runtime.CompilerServices.IsConst*,CD2DSizeU,System.Int32)
Constructs a CD2DBitmap object from file.
pParentTarget: A pointer to the render target.
lpszPath: Pointer to a null-terminated string that contains the name of file.
sizeDest: Destination size of the bitmap.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DBitmap.#ctor(CRenderTarget*,System.UInt32,System.Char!System.Runtime.CompilerServices.IsConst*,CD2DSizeU,System.Int32)
Constructs a CD2DBitmap object from resource.
pParentTarget: A pointer to the render target.
uiResID: The resource ID number of the resource.
lpszType: Pointer to a null-terminated string that contains the resource type.
sizeDest: Destination size of the bitmap.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DBitmap
ID2D1Bitmap wrapper.